Revit 2027 API
VertexStreamPositionColored.AddVertices Method
 Inserts multiple VertexStreamPositionColored instances into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertices(
	IList<VertexPositionColored> vertices
)
Public Sub AddVertices (
	vertices As IList(Of VertexPositionColored)
)
public:
void AddVertices(
	IList<VertexPositionColored^>^ vertices
)
member AddVertices :
        vertices : IList<VertexPositionColored> -> unit
Parameters
vertices IList<VertexPositionColored>
 The vertices to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace